Revit 2024 API
MacroManager.GetMacroManager Method (Application)
 Gets the Macro manager from the application.
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPIMacros (in RevitAPIMacros.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public static MacroManager GetMacroManager(
	Application application
)
Visual Basic
Public Shared Function GetMacroManager ( _
	application As Application _
) As MacroManager
Visual C++
public:
static MacroManager^ GetMacroManager(
	Application^ application
)
Parameters
application
Type: Autodesk.Revit.ApplicationServices.Application
 The application.
Return Value
 The new Macro manager object.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
MacroManager Class
GetMacroManager Overload
Autodesk.Revit.DB.Macros Namespace